#include <iostream>
#include <cstdio>
using namespace std;
int main() {
	printf("9/8=%d 9.0/8=%f 9/8.0=%f 9.0/8.0=%f\n",9/8,9.0/8,9/8.0,9.0/8.0);
	printf("10.0/6.0=%f",10.0/6.0);//保留小数点后面6位，四舍五入 
	printf("10.0/6.0=%.3f\n",10.0/6.0);//保留小数点后面3位 
	printf("10.0/6.0=%9.3f\n",10.0/6.0);//保留小数点后面3位，总体占9个空格 
	
/*	int a=88,b=89;
	printf("%d %d\n%d,%d\n%c,%c\na=%d,b=%d",a,b,a,b,a,b,a,b);  */
	
	float b=2323.34345;
	printf("%20.2lf\n",b);
	printf("%-20.2lf\n",b);//在输出内容后面 
	printf("%.2lf\n",b);
	
	return 0;
}
/*  使用scanf和printf函数比C++输入输出cin和cout效率高，速度快
	scanf和printf分别称为格式输入函数和格式输出函数，
	其关键字最末一个字符f即为“格式”(format)之意
	需要加上头文件<cstdio>
	
	printf函数格式：
		printf("格式控制字符串"，输出列表)
	格式字符串是以%开头的字符串，在%后面有各种格式字符，
	以说明输出数据的类型，形式，长度，小数位数等，
	【printf函数的格式符】 
	+--------+--------------------------------------------+
	|格式字符|意义                                        |
	+--------+--------------------------------------------+
    |d       |以十进制形式输出带符号整数（正数不输出符号）|
	|o       |以八进制形式输出无符号整数（不输出前缀0）   |
	|x,X     |以十六进制形式输出无符号整数（不输出前缀0x）|
	|u       |以十进制形式输出无符号整数                  |
	|f,lf    |以小数形式输出单，双精度实数                |
	|e,E     |以指数形式输出单，双精度实数                |
	|g,G     |以%f或%e中较短的输出宽度输出单双精度实数    |
	|c       |输出单个字符                                |
	|s       |输出字符串                                  |
	+--------+--------------------------------------------+  */
